Repository: FlipByBlink/MemorizeWidget
Catalog: iOS/Supporting files/🌐Localization/🌐VersionHistory.xcstrings
Source language: en
Languages: ja

# 1.0
source: Initial release
ja: 1回目のリリース

# 1.0.1
source: small bug fix on ver1.0
ja: バージョン1.0に存在した小さなバグを修正

# 1.0.2
source: Add circular lock screen widget support.
ja: 円形のロック画面ウィジェットのサポート追加。

# 1.1
source: ・Bigly improve importability. ・Comma-style and title-only-style import option. ・Text-encoded file format(e.g. csv, txt) widely support. ・Function to import text in app directly. ・Add lock screen widget to add new note. ・Add system dictionary support. ・Add customizable search function. ・Small fix/improve.
ja: ・インポート機能の大幅な改善。 ・カンマ区切り(csv形式)やタイトルのみのインポートに対応。 ・tsvだけでなくcsvやtxtといったテキストファイルに対応。 ・テキストをアプリ内で直接貼り付けてインポートする機能の追加。 ・新規ノート作成のためのロック画面ウィジェットを追加。 ・OS内蔵辞書をひく機能を追加。 ・Web検索等をするためのボタンを追加。(カスタマイズ可能) ・その他、細かな修正や改善。

# 1.1.1
source: - Support to import notes from other app directly with share-sheet. - Show notes count on footer. - Widely refactoring.
ja: ・「共有シート」を用いて他のアプリからノートを直接取り込めるようにしました。 ・ノートリストのフッターにノートの数を表示するようにしました。 ・広くリファクタリング。

# 1.1.2
source: Small UI fix
ja: 軽微なUI修正

# 1.2
source: ・Support "Sync by iCloud". ・Add "Show multi notes option". ・Add "Move top"/"Move end" buttons. ・Add "Trash". ・Add "Export data". ・Add "Large" widget family. ・Support Apple Watch. ・Support Mac. ・Change AD design. ・Fix system dictionary bug on iOS16.4. ・Remove "Sub widget(home screen small, home screen medium, lock screen circle)". ・Small fix/improve.
ja: ・iCloudによる端末間でのデータ同期をサポート ・複数個のノートを表示するオプションの追加 ・ノートを先頭や末尾へ移動する機能の追加 ・ゴミ箱機能の追加 ・データのエクスポート機能の追加 ・大きなサイズのウィジェットを追加 ・新たにApple Watchをサポート ・新たにMacをサポート ・広告デザインの変更 ・iOS16.4での辞書機能の不具合を修正 ・「予備のウィジェット(ホームスクリーン(小), ホームスクリーン(中), ロックスクリーン(円型))」を削除 ・その他、細かな修正や改善

# 1.2.1
source: FIX small bug
ja: 軽微なバグ修正

# 1.3
source: Support iOS 17 / watchOS 10 / macOS 14 Unsupport iOS 15.x Adjust font size on lock screen widget
ja: iOS 17/watchOS 10/macOS 14に対応しました iOS 15.xを非対応にしました ロック画面ウィジェットのフォントサイズを調整しました

# 1.4
source: Placeholder
ja: プレースホルダー
